Tekla.Structures.Catalogs.BrepType
Shape catalog renewal makes it possible to organize shapes in the shape catalog compared to a plain list before.
Thus, it is now possible and required to distinguish shapes in such a manner that:
BuildingProduct represent shapes that users can import from, for example, Tekla Warehouse and insert them into a model.
These are usually provided by the manufacturer and not detailed by users themselves.
StructuralShape represent shapes that get created by "Convert part to item" or from geometry editing.

Tekla.Structures.Catalogs.BrepType.BuildingProduct
Default value if the flag doesn't exist for the shape. It is also assigned in case of shape import.

Tekla.Structures.Catalogs.BrepType.StructuralShape
StructuralShape is assigned in case a shape is created by "Convert part to item", or on shape edit and save.